Sequential(
  (0): Conv2d(1, 32, kernel_size=(3, 3), stride=(1, 1))
  (1): Leaky()
  (2): Conv2d(32, 32, kernel_size=(3, 3), stride=(1, 1))
  (3): MaxPool2d(kernel_size=3, stride=3, padding=0, dilation=1, ceil_mode=False)
  (4): Leaky()
  (5): Conv2d(32, 10, kernel_size=(3, 3), stride=(1, 1))
  (6): Leaky()
  (7): Flatten(start_dim=1, end_dim=-1)
  (8): Linear(in_features=360, out_features=300, bias=True)
  (9): Leaky()
)